Public Attributes | List of all members
API_RailingToprailType Struct Reference
Element Manager API
Represents a Toprail element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Segment element owning this Toprail.
API_Guid  | symbID
The identifier of the symbol of this element.
bool  | visible
True, if the Rail is visible.
Detailed Description
Represents a Toprail element.
Member Data Documentation
◆ head
 API_RailingToprailType::head
General element header.
◆ owner
 API_RailingToprailType::owner
GUID of the Railing Segment element owning this Toprail.
◆ symbID
 API_RailingToprailType::symbID
The identifier of the symbol of this element.
◆ visible
 API_RailingToprailType::visible
True, if the Rail is visible.